#include "BOOK.h"

int Book::menu()
{
	system("cls");
	int nButton;
	cout << "=====================================================================================================================" << endl;
	cout << "=====================================================================================================================" << endl;
	cout << "\t\t\t\t\t환영합니다. 도서관리 프로그램입니다." << endl;
	cout << "=====================================================================================================================" << endl;
	cout << "=====================================================================================================================" << endl;
	cout << "\t\t\t\t\t\t\t메뉴" << endl;
	cout << "=====================================================================================================================" << endl;
	cout << "\t\t\t\t\t\t1. 전체 도서 목록 불러오기" << endl;
	cout << "=====================================================================================================================" << endl;
	cout << "\t\t\t\t\t\t2. 도서 추가하기" << endl;
	cout << "=====================================================================================================================" << endl;
	cout << "\t\t\t\t\t\t3. 도서 삭제하기" << endl;
	cout << "=====================================================================================================================" << endl;
	cout << "\t\t\t\t\t\t4. 도서 정보 검색" << endl;
	cout << "=====================================================================================================================" << endl;
	cout << "\t\t\t\t\t\t5. 도서 목록 초기화" << endl;
	cout << "=====================================================================================================================" << endl;
	cout << "\t\t\t\t\t\t6. 종료" << endl;
	cout << "=====================================================================================================================" << endl;
	cout << "사용할 기능의 번호를 입력하고 Enter를 눌러 주세요(6번을 누르거나 다른것을 누를시 프로그램이 종료됩니다.) : ";
	cin >> nButton;

	if (nButton >= 1 && nButton <= 6)
	{
		return nButton;
	}
	else
	{
		return 0;
	}
}

void Book::error()
{
	cout << endl << "\t\t\t\t\t== 다시 시도하여주세요 ==" << endl;
	system("pause");
}

void Book::NoBook()
{
	cout << endl << "\t\t\t\t\t == 도서가 없습니다. 메인 화면으로 돌아갑니다. == " << endl;
	system("pause");
}

void Book::CompleteDelete()
{
	cout << endl << "\t\t\t\t\t== 도서 삭제가 완료되었습니다!! ==" << endl;
	system("pause");
}

void Book::CompleteInsert()
{
	cout << endl << "\t\t\t\t\t== 도서 추가가 완료되었습니다!! ==" << endl;
	system("pause");
}

void Book::GetName()
{
	cout << endl << "책의 이름(영문 100자 이내, 한글 30자 이내, 공백포함, 처음에 공백이 있으면 실행실패) : ";
}

void Book::GetWriter()
{
	cout << endl << "책의 작가(영문 100자 이내, 한글 30자 이내, 공백포함, 처음에 공백이 있으면 실행실패) : ";
}

void Book::GetYear()
{
	cout << endl << "출판 년도(0~9999까지의 숫자를 입력하여 주세요) : ";
}

void Book::GetInformation()
{
	cout << endl << "\t\t\t책의 정보(영문 100자 이내, 한글 30자 이내, 공백포함, 처음에 공백이 있으면 실행실패) : ";
}

void Book::HowInitialize()
{
	cout << "\t\t\t\t\t== 전체 도서 목록을 초기화 하시겠습니까?? ==" << endl << endl << "\t\t\t\t\t== 희망 하시는 경우 'y'를 입력 후 엔터를 눌러주세요 ==" << endl << endl;
}

void Book::InitializeComplete()
{
	cout << "\t\t\t\t\t== 초기화가 완료 되었습니다!! ==" << endl;
	system("pause");
}